# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'nicoverbruggen/homebrew-cask' # phpmon

# Shell
brew 'starship'

# Dev
brew 'colima'
brew 'go'

# PHP
brew 'composer'
brew 'gpg'
brew 'imagemagick'
brew 'php@8.1'
brew 'php@8.2'
cask 'phpmon'

# Java
brew 'java'
brew 'jenv'
brew 'openjdk@17'

# Ionic
brew 'cocoapods'
brew 'ios-deploy'

# Minecraft
brew 'fabric-installer'
brew 'ferium'
cask 'minecraft'
cask 'prismlauncher'

# Other
brew 'ffmpeg'
brew 'gh'
brew 'jq'
brew 'mdcat'

# Apps
cask '1password'
cask 'airbuddy'
cask 'alfred'
cask 'daisydisk'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'keka'
cask 'obsidian'
cask 'ray'
cask 'raycast'
cask 'rectangle'
cask 'sequel-ace'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'telegram'
cask 'todoist'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-fira-code-nerd-font'
