# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Shell
brew 'starship'
brew 'eza'

# Dev
brew 'colima'
brew 'go'

# PHP
brew 'composer'
brew 'gpg'
brew 'imagemagick'
brew 'php@8.4'
cask 'herd'
cask 'symfony-cli/tap/symfony-cli'

# Java
brew 'java'
brew 'jenv'
brew 'openjdk@17'

# Ionic
brew 'cocoapods'
brew 'ios-deploy'

# Minecraft
brew 'fabric-installer'
brew 'ferium'
cask 'minecraft'
cask 'prismlauncher'

# Other
brew 'ffmpeg'
brew 'gh'
brew 'jq'
brew 'mdcat'

# Apps
cask '1password'
cask 'airbuddy'
cask 'arc'
cask 'daisydisk'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'dupeguru'
cask 'fantastical'
cask 'firefox'
cask 'ghostty'
cask 'google-chrome'
cask 'hiddenbar'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'keka'
cask 'notion'
cask 'obsidian'
cask 'openvpn-connect'
cask 'orbstack'
cask 'postman'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram'
cask 'todoist'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vlc'
cask 'whatsapp'
cask 'yacreader'

# Fonts
cask 'font-fira-code-nerd-font'
